Repository: lpoaura/GN2PG
Catalog: gn2pg/locale/*/LC_MESSAGES/gn2pg.po
Languages: fr_fr

source: controler is %s
fr_fr: Le controlleur est %s

source: Successfully logged in into GeoNature named %s
fr_fr: La connexion au GeoNature nommé %s réussie

source: Modules API status code is %s for url %s
fr_fr: Le code d'état de l'API des modules est %s pour l'url %s

source: Export api path is %s
fr_fr: Le chemin d'export API est %s

source: Get GeoNature modules failed with status code %s, cause: %s
fr_fr: La récupération des modules GeoNature a échoué avec le code d'état %s, cause : %s

source: Download page %s
fr_fr: Téléchargement de la page %s

source: Download data from %s failed
fr_fr: Le téléchargement des données depuis %s a échoué

source: Error creating %s configuration
fr_fr: Erreur durant la création de la configuration %s

source: Loading TOML configuration %s
fr_fr: Chargement de la configuration TOML %s

source: Incorrect content in YAML configuration %s : %s
fr_fr: Contenu incorrect dans la configuration YAML %s : %s

source: Source "%s" identifier will be "%s"
fr_fr: L'identifiant de la source "%s" sera "%s"

source: Source #%s named "%s" (->%s) already used by another source
fr_fr: Le nom de source #%s nommée "%s" (->%s) est déjà utilisé

source: Settings for %s are : %s
fr_fr: Les paramètres de %s sont : %s

source: %s %d datas (%d/%d %.2f %%) from %s %s
fr_fr: %s %d données (%d/%d %.2f %%) depuis %s %s

source: Getting items from controler %s
fr_fr: Récupération des éléments du contrôleur %s

source: QueryStrings %s
fr_fr: Chaînes de requête %s

source: Updating items from controler %s
fr_fr: Mise à jour des éléments du contrôleur %s

source: No download exists in the import table for source %s, a complete download will be launched
fr_fr: Aucun téléchargement n'existe dans la table des imports pour la source %s, Un téléchargement complet va être lancé

source: Getting new or update data from source %s since %s
fr_fr: Obtention de données nouvelles ou mises à jour de la source %s depuis %s

source: A problem occured on UPDATE process for source %s : %s
fr_fr: Un problème est survenu dans le processus UPDATE pour la source %s : %s

source: Conf directory %s created
fr_fr: Dossier de configuration %s créée

source: %s file already exists
fr_fr: Le fichier %s existe déjà

source: File %s will be preserved
fr_fr: Le fichier %s sera conservé

source: file %s will be overwritten
fr_fr: Le fichier %s sera remplacé

source: %s => Starting download using controler %s
fr_fr: %s => Démarrage du téléchargement à l'aide du contrôleur %s

source: %s => Ending download using controler %s
fr_fr: %s => Fin du téléchargement en utilisant le contrôleur %s

source: Defining full download jobs
fr_fr: Définition des tâches de téléchargement complet

source: Starting full download for source %s
fr_fr: Démarrage du téléchargement complet de la source %s

source: Source %s is disabled
fr_fr: La source %s est désactivée

source: config source name %s
fr_fr: Le nom de la source de configuration est %s

source: controler %s
fr_fr: Controlleur %s

source: choose config to open :
fr_fr: Choississez une configuration à ouvrir :

source: Sorry, you must enter a number.
fr_fr: Désolé, vous devez entrer un nombre.

source: Config management commands
fr_fr: Commandes de gestion de la configuration

source: Print version number
fr_fr: Affichage du numéro de version

source: Increase output verbosity
fr_fr: Augmenter la verbosité de la sortie

source: Reduce output verbosity
fr_fr: Réduire la verbosité de la sortie

source: Initialize the TOML configuration file
fr_fr: Initialisation du fichier de configuration TOML

source: List config files
fr_fr: Lister les configurations

source: Execute custom SQL script in DB, default is "to_gnsynthese". You can also use your own script by using absolute file path instead of "to_gnsynthese"
fr_fr: Exécute un script SQL personnalisé dans la base de données, la valeur par défaut est "to_gnsynthese". Vous pouvez également utiliser votre propre script en utilisant le chemin de fichier absolu à la place de "to_gnsynthese"

source: Create or recreate json tables
fr_fr: Créer ou recréer des tables json

source: Perform a full download
fr_fr: Effectuer un téléchargement complet

source: Perform an incremental download
fr_fr: Effectuer un téléchargement incrémentiel

source: You must provide a config file
fr_fr: Vous devez fournie un fichier de configuration

source: Perform update action
fr_fr: Effectuer une action de mise à jour

source: Execute custom script %s on db
fr_fr: Exécution du script personnalisé %s sur la base de données

source: An error occured while trying to connect to database : %s
fr_fr: Une erreur s'est produite lors de la connexion à la base de données: %s

source: Execute: %s
fr_fr: Exécuter: %s

source: Schema %s owned by %s successfully created
fr_fr: Le schéma %s appartenant à %s a été créé avec succès.

source: Failed to create %s schema
fr_fr: Échec de la création du schéma %s

source: Counting datas in database for all sources
fr_fr: Comptage des données dans la base de données pour toutes les sources

source: Connecting to database %s
fr_fr: Connexion à la base de données %s

source: Start to execute %s script
fr_fr: Lancement de l'exécution du script %s

source: You choosed to use internal to_gnsynthese.sql script in schema %s
fr_fr: Vous avez choisi d'utiliser le script interne to_gnsynthese.sql dans le schéma %s

source: file %s exists, continue
fr_fr: le fichier %s existe, continuer

source: file %s DO NOT EXISTS, exit
fr_fr: le fichier %s N'EXISTE PAS, quitter

source: script %s successfully applied
fr_fr: script %s appliqué avec succès

source: Entry into StorePostgresql
fr_fr: Entrée dans StorePostgresql

source: A data with UUID %s from a different source already exists in Database: %s
fr_fr: Une donnée avec l'UUID %s existe déjà avec une source différente: %s
